app/controllers/wishes_controller.rb

SELECT "wishes".* FROM "wishes" WHERE "wishes"."user_id" = $1  [["user_id", 6]]
---
  def index
    @wishes = current_user.wishes.all

INSERT INTO "wishes" ("user_id", "goal", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 6], ["goal", "Test wish"], ["created_at", 2017-05-05 19:23:22 UTC], ["updated_at", 2017-05-05 19:23:22 UTC]]
---
  def create
    # require 'pry'
    # binding.pry
    @wish = current_user.wishes.build(wish_params)
      @wish.valid?
    if @wish.save

UPDATE "wishes" SET "goal" = $1, "updated_at" = $2 WHERE "wishes"."id" = $3  [["goal", "new wish"], ["updated_at", 2017-05-05 23:05:35 UTC], ["id", 3]]
---
  def update
    if @wish.update(wish_params)

DELETE FROM "wishes" WHERE "wishes"."id" = $1  [["id", 18]]
---
  def destroy
    @wish.destroy

SELECT  "wishes".* FROM "wishes" WHERE "wishes"."user_id" = $1 AND "wishes"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 18], ["LIMIT", 1]]
---
    def set_wish
      # @wish = Wish.find(params[:id])
      validate_user
      @wish = current_user.wishes.find(params[:id])